SpenceKonde/DxCore/megaavr/variants/28pin-duseries/pins_arduino.h
/* Use this for accessing PINnCTRL register */
const uint8_t digital_pin_to_bit_position[] = {
  #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
    PIN0_bp,   //  0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if ((CLOCK_SOURCE & 0x03) == 1) // PA1 also used for crystal
    NOT_A_PIN, //  1 PA1
  #else
    // PA1 used for external crystal.
    PIN1_bp,
  #endif
  PIN2_bp,   //  2 PA2/SDA
  PIN3_bp,   //  3 PA3/SCL
  PIN4_bp,   //  4 PA4/MOSI
  PIN5_bp,   //  5 PA5/MISO
  PIN6_bp,   //  6 PA6/SCK
  PIN7_bp,   //  7 PA7/SS/CLKOUT
  NOT_A_PIN, //  VUSB
  NOT_A_PIN, //  DM
  NOT_A_PIN, //  DP
  PIN3_bp,   // 11 PC3
  PIN0_bp,   // 12 PD0/AIN0
  PIN1_bp,   // 13 PD1/AIN1
  PIN2_bp,   // 14 PD2/AIN2
  PIN3_bp,   // 15 PD3/AIN3/LED_BUILTIN
  PIN4_bp,   // 16 PD4/AIN4
  PIN5_bp,   // 17 PD5/AIN5
  PIN6_bp,   // 18 PD6/AIN6
  PIN7_bp,   // 19 PD7/AIN7/AREF
  PIN0_bp,   // 20 PF0/USART2_Tx/TOSC1
  PIN1_bp,   // 21 PF1/USART2_Rx/TOSC2
  NOT_A_PIN, // 22
  NOT_A_PIN, // 23
  NOT_A_PIN, // 24
  NOT_A_PIN, // 25
  PIN6_bp,   // 26 PF6 RESET
  PIN7_bp    // 27 PF7 UPDI
};

/* Use this for accessing PINnCTRL register */
const uint8_t digital_pin_to_bit_mask[] = {
  #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
    PIN0_bm,   //  0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if ((CLOCK_SOURCE & 0x03) == 1) // PA1 also used for crystal
    NOT_A_PIN, //  1 PA1
  #else
    // PA1 used for external crystal.
    PIN1_bm,
  #endif
  PIN2_bm,   //  2 PA2/SDA
  PIN3_bm,   //  3 PA3/SCL
  PIN4_bm,   //  4 PA4/MOSI
  PIN5_bm,   //  5 PA5/MISO
  PIN6_bm,   //  6 PA6/SCK
  PIN7_bm,   //  7 PA7/SS/CLKOUT
  NOT_A_PIN, //  VUSB
  NOT_A_PIN, //  DM
  NOT_A_PIN, //  DP
  PIN3_bm,   // 11 PC3
  PIN0_bm,   // 12 PD0/AIN0
  PIN1_bm,   // 13 PD1/AIN1
  PIN2_bm,   // 14 PD2/AIN2
  PIN3_bm,   // 15 PD3/AIN3/LED_BUILTIN
  PIN4_bm,   // 16 PD4/AIN4
  PIN5_bm,   // 17 PD5/AIN5
  PIN6_bm,   // 18 PD6/AIN6
  PIN7_bm,   // 19 PD7/AIN7/AREF
  PIN0_bm,   // 20 PF0/USART2_Tx/TOSC1
  PIN1_bm,   // 21 PF1/USART2_Rx/TOSC2
  NOT_A_PIN, // 22 NON_PIN
  NOT_A_PIN, // 23 NON_PIN
  NOT_A_PIN, // 24 NON_PIN
  NOT_A_PIN, // 25 NON_PIN
  PIN6_bm,   // 26 PF6 RESET
  PIN7_bm    // 27 PF7 UPDI
};

const uint8_t digital_pin_to_timer[] = {
  NOT_ON_TIMER, //  0 PA0/USART0_Tx/CLKIN
  NOT_ON_TIMER, //  1 PA1/USART0_Rx
  TIMERB0,      //  2 PA2/SDA
  TIMERB1,      //  3 PA3/SCL
  TIMERD0_0WOA, //  4 PA4/MOSI      WOA
  TIMERD0_0WOB, //  5 PA5/MISO      WOB
  TIMERD0_0WOC, //  6 PA6/SCK       WOC mirrors WOA
  TIMERD0_0WOD, //  7 PA7/SS/CLKOUT WOD mirrors WOB
  NOT_ON_TIMER, //  VUSB
  NOT_ON_TIMER, //  DM
  NOT_ON_TIMER, //  DP
  NOT_ON_TIMER, // 11 PC3
  NOT_ON_TIMER, // 12 PD0/AIN0
  NOT_ON_TIMER, // 13 PD1/AIN1 // Default TCA0 WO1
  NOT_ON_TIMER, // 14 PD2/AIN2 // Default TCA0 WO2
  NOT_ON_TIMER, // 15 PD3/AIN3 // Default TCA0 WO3
  TIMERD0_4WOC, // 16 PD4/AIN4 // Default TCA0 WO4
  TIMERD0_4WOD, // 17 PD5/AIN5 // Default TCA0 WO5
  DACOUT,       // 18 PD6/AIN6
  NOT_ON_TIMER, // 19 PD7/AIN7/AREF
  TIMERD0_2WOA, // 20 PF0/USART2_Tx/TOSC1
  TIMERD0_2WOB, // 21 PF1/USART2_Rx/TOSC2
  NOT_ON_TIMER, // 22 NON_PIN
  NOT_ON_TIMER, // 23 NON_PIN
  NOT_ON_TIMER, // 24 NON_PIN
  NOT_ON_TIMER, // 25 NON_PIN
  NOT_ON_TIMER, // 26 PF6 RESET
  NOT_ON_TIMER, // 27 PF7 UPDI
};

#endif
  // These are used for CI testing. They should *not* *ever* be used except for CI-testing where we need to pick a viable pin to compile a sketch with that won't generate compile errors (we don't care whether it would;d actually work, we are concerned with )
  #if ((CLOCK_SOURCE & 0x03) == 0)
    #define _VALID_DIGITAL_PIN(pin)  ((pin) >= 0 &&  (pin) <  4  ? ((pin) + 2 )      : NOT_A_PIN)
  #else
    #define _VALID_DIGITAL_PIN(pin)  ((pin) >= 0 &&  (pin) <  4  ? ((pin) + 0 )      : NOT_A_PIN)
  #endif
  #define    _VALID_ANALOG_PIN(pin)  ((pin) >= 0 && ((pin) <= 4) ? ((pin) + PIN_PD4) : NOT_A_PIN)
#endif
